stress.yml
config:
 target: 'http://localhost:3003'
 http:
   pool: 20 # All HTTP requests from all virtual users will be sent over the same 10 connections
 phases:
   # - duration: 10
   #   arrivalRate: 10
   - duration: 20
     arrivalRate: 20
     rampTo: 50
   # - duration: 10
   #   arrivalRate: 50
   # - duration: 30
   #   arrivalRate: 20
   #   rampTo: 35
   # - duration: 10
   #   arrivalRate: 20
   # - duration: 30
   #   arrivalRate: 10
   #   rampTo: 20
   # - duration: 10
   #   arrivalRate: 20
   # - duration: 30
   #   arrivalRate: 10
   #   rampTo: 20
   # - duration: 10
   #   arrivalRate: 20
   # - duration: 30
   #   arrivalRate: 10
 processor: "./generateRandom.js"
 

scenarios:
 - name: "View a restaurant"
   flow:
     # call generateRandomData() to create the id variables
     
       - function: "generateRandomData"
       - loop:
       # - get:
       #     url: "/restaurants/{{ id }}"
       # - get:
       #     url: "/restaurants/{{ id }}/bundle.js"
           - get:
               url: "/api/restaurants/{{ id }}/sidebar"  

       # - log: "Sent a request to /restaurants with {{ id }}"          
         count: 40